
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                        |
|:--------:|:-------------------------------------------------------------------------------------------------|
|    🟢    | `aws_iam_role_policy_attachment.registry-client["terraform-aws-truststore"]`                     |
|    🟢    | `module.registry-client-roles["terraform-aws-truststore"].aws_iam_role.github`                   |
|    🟡    | `module.release_infrahouse_com["oracular"].module.key.aws_secretsmanager_secret_version.current` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.registry-client["terraform-aws-truststore"] will be created
  + resource "aws_iam_role_policy_attachment" "registry-client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/registry-client20240303235455581600000001"
      + role       = "ih-tf-terraform-aws-truststore-github"
    }

  # module.registry-client-roles["terraform-aws-truststore"].aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-truststore:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo terraform-aws-truststore"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-terraform-aws-truststore-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-role/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.release_infrahouse_com["oracular"].module.key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/release_infrahouse_com.key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-oracular-gxDJjw",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.release_infrahouse_com["oracular"].module.key.aws_secretsmanager_secret_version.current will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "current" {
        id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-oracular-gxDJjw|terraform-20241220213742492900000003"
      ~ version_stages = [
          - "AWSPREVIOUS",
            # (1 unchanged element hidden)
        ]
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDB9fQ==
```
</details>